import numpy as np
import cvxpy as cp

c = np.mat(    [[390.6, 618.5 , 553  , 442  , 113.1, 5.2   , 1217.7, 1011],
                [370.8, 636   , 440  , 401.8, 25.6 , 113.1 , 1172.4, 894.5],
                [876.3, 1098.6, 497.6, 779.8, 903  , 1003.3, 907.2 , 40.1 ],
                [745.4, 1037  , 305.9, 725.7, 445.7, 531.4 , 1376.4, 768.1],
                [144.5, 354.5 , 624.7, 238  , 290.7, 269.4 , 993.2,  974],
                [200.2, 242   , 691.5, 173.4, 560  , 589.7 , 661.8 , 855.7],
                [235  , 205.5 , 801.5, 326.6, 477  , 433.6 , 966.4 , 1112],
                [517  , 541.5 , 338.4, 219  , 249.5, 335   , 937.3 , 701.8],
                [542  , 321   , 1104 , 576  , 896.8, 878.4 , 728.3 , 1243],
                [665  , 827   , 427  , 523.2, 725.2, 813.8 , 692.2 , 284],
                [799  , 855.1 , 916.5, 709.3, 1057 , 1115.5, 300   , 617],
                [852.2, 798   , 1083 , 714.6, 117.4, 1216.8, 40.8  , 898.2],
                [602  , 614   , 820  , 517.7, 899.6, 952.7 , 272.4 , 727],
                [903  , 1092.5, 612.5, 790  , 932.4, 1034.9, 777   , 152.3],
                [600.7, 710   , 522  , 448  , 726.6, 811.8 , 563   , 426.8]])

a = np.mat([3000, 3100, 2900, 3100, 3100, 3400, 3500, 3200, 3000, 3100, 3300, 3200, 3300, 2900, 3100])
b = np.mat([18600, 19600, 17100, 18900, 17000, 19100, 20500, 17200])


d = a.reshape(1,-1)#需求量向量
e = b.reshape(-1,1)#储存量向量
x = cp.Variable((8,15))
a = cp.Variable((8,15),integer = True) #0-1变量,须有参数integer = True的设定才可定义0-1变量

obj =cp.Minimize(cp.sum(cp.multiply(c.T, x)))
# con1 = [cp.sum(x,axis = 1,keepdims = True) <= e,cp.sum(x,axis = 0,keepdims = True) == d,0<=x]
#
con2 = [cp.sum(x,axis = 1,keepdims = True) <= e,cp.sum(x,axis = 0,keepdims = True) == d, 0 <=a, a <= 1, 1000*a <= x,x <= 2000*a]  #约束条件，其中0-1变量就设为大于等0+小于等于1即可
# prob1 = cp.Problem(obj,con1)
prob2 = cp.Problem(obj,con2)
# prob1.solve(solver = 'GLPK_MI',verbose = True)
prob2.solve(solver = 'GLPK_MI',verbose = True)
print("第二问最优值为：",prob2.value)
print("第二问最优解为：\n",x.value.T)
print("是否配送的选择为：\n",a.value)